bench/rheotool/cylinder_newtonian_re1_shrunk15R/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       40567;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          264;
        startFace       40647;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          378;
        startFace       40911;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       41289;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          40988;
        startFace       41409;
    }
)

// ************************************************************************* //
